/*************************************************
  Copyright (C), 1994-2014, Wangxin
  File name:      interface
  Author:    Wanxin   Version: 1.0       Date: 2014.6.10
  Description:    该程序实现打印出界面
  Others:         无
  Function List:  
                  interface
		  打印出界面
  History:        no
*************************************************/

#include <stdio.h>
#include "../../include/typedef.h"

/*************************************************
  Function:       interface
  Description:    打印界面
  Calls:          no
  Called By:      main park see out
  Input:          park_stack,temp_stack,wait_queue
  Output:         no
  Return:         no
  Others:         no
*************************************************/

void interface(Stack *park_stack, Stack *temp_stack, Link_queue *wait_queue)
{
    printf("\t\033[40;36m+------------------------------------------------------+\n\033[0m");
    printf("\t\033[40;36m|\033[0m\033[40;37m****\033[0m                                              \033[40;37m****\033[0m\033[40;36m|\033[0m\n");
    printf("\t\033[40;36m|\033[0m\033[40;34m********\033[0m         \033[40;31m欢迎使用新智停车管理\033[0m         \033[40;34m********\033[0m\033[40;36m|\033[0m\n");
    printf("\t\033[40;36m|\033[0m\033[40;32m****\033[0m                                              \033[40;32m****\033[0m\033[40;36m|\033[0m\n");
    printf("\t\033[30;36m|------------------------------------------------------|\033[0m\n");
    printf("\t\033[30;36m|********                                      ********|\033[0m\n");
    printf("\t\033[40;36m|\033[0m\033[40;33m****\033[0m             \033[40;36m1.我想停车\033[0m                       \033[40;33m****\033[0m\033[40;36m|\033[0m\n");
    printf("\t\033[40;36m|\033[0m\033[40;34m****\033[0m             \033[40;36m2.我想开走我停的车\033[0m               \033[40;34m****\033[0m\033[40;36m|\033[0m\n");
    printf("\t\033[40;36m|\033[0m\033[40;34m****\033[0m             \033[40;36m3.我想查看当前停车场情况\033[0m         \033[40;34m****\033[0m\033[40;36m|\033[0m\n");
    printf("\t\033[40;36m|\033[0m\033[40;33m****\033[0m             \033[40;36m4.我想退出\033[0m                       \033[40;33m****\033[0m\033[40;36m|\033[0m\n");
    printf("\t\033[40;36m|********                                      ********|\n\033[0m");
    printf("\t\033[40;36m+------------------------------------------------------+\033[0m\n\n");
    
    choose(park_stack,temp_stack,wait_queue);//函数调用
}
